results/M3/M3-DP-20260920T1610Z/cases/dp031_coarse_a0/dictionaries/system/extrudeMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

constructFrom   patch;
sourceCase      "<case>";
sourcePatches   (front);
exposedPatchName back;

extrudeModel    wedge;
sectorCoeffs
{
    point       (0 0 0);
    axis        (1 0 0);
    angle       5;
}

flipNormals     false;
mergeFaces      false;
